/*
 * Licensed under the MIT license.
 * Copyright (c) 2023 Bohdan Shtepan <bohdan@shtepan.com>
 */


const ua = {
    'debug': {
        'main_btn_title': 'Почати',
    },
    'general': {
        'app_error': 'Упс...! Тут сталася помилочка. Спробуйте пізніше.',
        'hours_short': 'г',
        'minutes_short': 'х',
    },
    'app_tour': {
        'page_title': 'Гід по додатку',
        'tour_text_lines': {
            '0': {
                'headline': 'Бронюйте квитки в кіно за кілька дотиків',
                'description': 'Економте час та насолоджуйтесь зручним бронюванням',
            },
            '1': {
                'headline': 'Переосмисліть ваш підхід до перегляду кіно',
                'description': 'Зробіть свій кіно-досвід простим та приємним',
            },
            '2': {
                'headline': 'Дивіться останні новинки та популярні фільми',
                'description': 'Більше не пропускайте свої улюблені фільми',
            },
        },
        'main_btn_title_start': 'Почати',
        'main_btn_title_next': 'Далі',
        'main_btn_title_finish': 'Завершити',
    },
    'movies': {
        'page_title': 'Сьогодіні в кіно',
        'categories_section_title': 'Жанри',
        'showing_now_section_title': 'Сьогодні в кіно',
        'upcoming_section_title': 'Скоро в кіно',
        'title_label_one': '{{count}} фільмів',
        'title_label_other': '{{count}} фільмів',
        'movie_label_premiere': 'Прем\'єра!',
        'movie_label_available_now': 'Уже доступно!',
        'main_btn_title': 'Мої квитки',
        'categories': {
            '28': '💣 Бойовик',
            '12': '🏝️ Пригоди',
            '16': '🧸 Мультфільм',
            '35': '🎭 Комедія',
            '80': '🔫 Скримінал',
            '99': '📚 Документалка',
            '18': '😭 Драма',
            '10751': '👪 Сімейний',
            '14': '🐉 Фентезі',
            '36': '🏺 Історія',
            '27': '📚 Жахи',
            '10402': '🎶 Мюзкл',
            '9648': '👻 Містерія',
            '10749': '💏 Romance',
            '878': '🧬 Наукова фантастика',
            '10770': '🧬 Теле-фільм',
            '53': '🕵️ Триллер',
            '10752': '⚔️ Воєнний',
            '37': '🏇Вестрн',
        },
    },
    'movie_details': {
        'main_btn_title': 'Бронювання',
        'synopsis_section_title': 'Сюжет',
        'cast_section_title': 'Актори',
        'watch_from': 'В кіно з',
        'in_cinema_til': 'В кіно до',
    },
    'my_tickets': {
        'page_title': 'Мої квитки',
        'seats_label': 'Місця',
    },
    'booking': {
        'page_title': 'Бронювання квитків',
        'available_label': 'Вільно',
        'selected_label': 'Вибрано',
        'reserved_label': 'Зайнято',
        'schedule_note': 'Зверніть увагу, щосереди ми оновлюємо графік сеансів на тиждень вперед, з четверга по середу.',
        'dat_section_header': 'Дата та час',
        'main_btn_title': 'Оплатити ${{ amount }}',
        'screen_label': 'Екран',
    },
};

export default ua;
